/*
 * 
 * 		대입연산자
 * 		연산순서 (일반 연산자는 좌>우 방향)
 * 			   (하지만 대입연산자는 우>좌 방향!)
 * 		우>좌
 * 		a=10+30 
 * 		 <----- 뒤의 값을 계산해서 a에 집어넣으라는 뜻.
 * 		
 * 		=
 * 		---------------	복합대입연산자
 * 		***+=		=> 누적(총합을 구할 때 많이 쓰임)
 * 		***-=
 * 		*=
 * 		/=
 * 		%=
 * 		<<=
 * 		>>=
 * 		&=
 * 		|=
 * 		^=
 * 		----------------
 * 
 * 		+=
 * 		----
 * 		int a=10;
 * 		a+=10;  ===> a=a+10 => 20
 * 		a+=1;	==> a=a+1 = a++ = ++a (하나씩 증가할때는 증감연산자가 편하고, 2이상 증가할때는 복합대입연산자)
 * 		------------------------------
 * 		a+=20	a=a+20
 * 		a-=20	a=a-20
 * 		a*=10	a=a*10
 * 		a/=10	a=a/10
 * 		a%=2	a=a%2
 * 		
 */
public class 대입연산자 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		/* int a=10;
		a+=3; // a=a+3
		System.out.println(a); */
		/* int a=10;
		 *a++;
		  a++;
		  a++;
		 System.out.println(a); */
				
	}

}
